{"published":[{"title":"Nhục Driven Development","url":"posts/nhuc-driven-development.html","desc":"Mình là một người thích ăn gạch =.= nhất là gạch đá từ các bài viết mà mình viết ra. Việc hứng gạch đá nếu nghĩ một cách lạc quan thì cũng là một phương pháp kiểm chứng kiến thức của mình, và qua trao đổi, hỏi đáp ở phần comment mỗi bài viết. Mình cũng có cơ hội nâng cao kiến thức khá nhiều. Nếu có ..."},{"title":"Làm game Flappy Bird trên Arduino","url":"posts/lam-game-flappy-bird-tren-arduino.html","desc":"Giới thiệu một tí, ngày nay, lĩnh vực điện tử đang dần được nhiều người quan tâm, bản thân mình cũng bắt đầu cố gắng tìm hiểu mảng này từ khá lâu (hơn 10 năm trước) nhưng tiếc là dốt Toán/Lý, cũng không phải dân học Điện tử nên sau gần 10 năm mới có làm được ít thứ để khoe với bạn bè..."},{"title":"Tản mạn chuyện viết lách","url":"posts/chuyen-viet-lach.html","desc":"Chuyện sợ viết là một điều bình thường và phổ biến ở rất rất nhiều người, nhất là dân học IT, vốn không biết từ đâu bị gắn cho cái mác khô khan. Mấy ngày gần đây mình lại thấy nhiều người than vãn là không dám viết, không có khả năng viết. Cũng là người hay viết linh tinh trên mạng nên mình cũng muốn..."},{"title":"Dân IT đọc sách như thế nào đây?","url":"posts/dan-it-doc-sach.html","desc":"Nhân dịp đầu năm, mình xin viết một bài bàn về chuyện đọc sách, dựa trên những kinh nghiệm cá nhân, dành tặng các bạn nào đã trót đặt ra mục tiêu đọc 10 hay 20 cuốn sách trong năm mới **một lần nữa** và chưa có cơ hội thực hiện. Và cả những bạn nào chưa có ý định đọc sách. Hy vọng các bạn sẽ..."},{"title":"Làm thế nào để viết blog kĩ thuật?","url":"posts/lam-the-nao-viet-blog-ki-thuat.html","desc":"Tại sao phải viết blog kĩ thuật? Làm thế nào để viết blog kĩ thuật? Viết blog kĩ thuật như thế nào cho hay?"},{"title":"Motion và Repeat trong Vim","url":"posts/vim-motion-va-repeat.html","desc":"Ở [bài trước](https://huytd.github.io/posts/vai-phim-tat-vim.html) mình có đề cập tới **Visual mode** của Vim, để thực hiện các thao tác bôi chọn một vùng nội dung rồi thực hiện một thao tác nào đó. Đối với những ai vừa mới chuyển qua Vim từ các editor khác thì có thể sử dụng visual mode để làm quen..."},{"title":"Vài phím kinh nghiệm thường gặp khi dùng Vim","url":"posts/vai-phim-tat-vim.html","desc":"Tình hình là mình chuyển qua dùng Vim làm editor chính cho cả công việc lẫn mấy việc lặt vặt (side projects, blog,...) cũng được hơn 1 tháng rồi. Thực ra dùng lâu rồi nhưng thấy ko quen nên bỏ :v bây giờ quyết định chuyển hẳn qua và tập sử dụng một cách nghiêm túc.Viết bài này chia sẽ một vài..."},{"title":"Kinh nghiệm làm việc với Cgo","url":"posts/vai-dieu-ve-cgo.html","desc":"Cuối tuần vừa rồi mình có làm một project nho nhỏ để học hỏi thêm, điểm khá thú vị là project này tuy không to lắm nhưng lại chứa khá là nhiều vấn đề và buộc mình phải tìm hiểu sâu vào rất nhiều mảng kĩ thuật.Một trong những chức năng của project này là việc chụp ảnh màn hình (screenshot), cũng nhờ ..."},{"title":"Tiết kiệm thời gian commit bằng WhatTheCommit","url":"posts/what-the-commit.html","desc":"WhatTheCommit là một trang web cung cấp các đoạn text ngẫu nhiên, ý đồ của tác giả trang web này là để sử dụng nội dung này vào cho các commit khi làm việc với Git để tiết kiệm thời gian :))) Chúng ta có thể dùng `curl` để lấy nội dung ngẫu nhiên từ trang web này..."},{"title":"var, let và const trong ES6","url":"posts/var-let-const.html","desc":"Mấy bài viết nói về 3 từ khóa này trong JavaScript thì có nhiều rồi, mình chỉ tổng hợp lại cho ngắn để các bạn lười đọc tham khảo nhanh thôi :trollface: const`const` dùng để khai báo một hằng số - là một giá trị không thay đổi được trong suốt quá trình chạy..."},{"title":"Dùng neovim thay thế vimdiff","url":"posts/compare-neovim.html","desc":"Nếu xài Git và **vim** hẳn các bạn biết tool **vimdiff**, dùng để xem diff và merge code. **neovim** cũng có chế độ diff tuy nhiên cách cài đặt nó để thay thế cho **vimdiff** hơi rườm rà một tí. Để tiết kiệm thời gian thì mình share lên đây luôn. Các bạn có thể copy phần cấu hình dưới đây vào file..."},{"title":"Vài điều linh tinh về Github","url":"posts/tan-man-github.html","desc":"Có lẽ đối với dân developer thì không ai lạ gì Github. Có lẽ ngoài StackOverflow ra thì đây là một trang web có tần suất truy cập thường xuyên nhất của một developer chân chính :troll: Github là cái gì? Dành cho các bạn chưa biết, thì Github là một dịch vụ lưu trữ mã nguồn phổ biến nhất hiện nay..."},{"title":"Một commit cho 2 branches - Cherrypick","url":"posts/git-cherry-pick.html","desc":"Hôm nay mình gặp phải một trường hợp cần apply cùng một thay đổi cho cả 2 branches khác nhau trong project. Giả sử bạn có 2 branches khác nhau cho 2 khách hàng khác nhau, tạm gọi là branch A và branch B. Và bạn đang fix một bug nghiêm trọng cùng tồn tại trên hệ thống của cả 2 khách hàng, bạn muốn..."},{"title":"TDD qua ví dụ thực tế","url":"posts/tdd.html","desc":"TDD (Test Driven Development) - tức là một phương pháp lập trình chú trọng vào việc test, \"viết test trước viết code sau\",... rất nhiều người đã thử tìm hiểu về TDD và đều đọc được những định nghĩa như thế này trong các bài viết, nhưng cuối cùng khi đọc xong thì vẫn không hiểu nổi TDD là gì..."},{"title":"Tự viết Emulator: CHIP-8 Interpreter","url":"posts/tu-viet-emulator.html","desc":"Nhắc đến game giả lập, chắc không ai lạ gì và ai cũng từng chơi qua (giả lập NES, Gameboy, PS1, PS2,...)Và chắc hẳn, cũng có không ít bạn nung nấu ý định tự viết một bộ emulator cho riêng mình nhưng không biết bắt đầu từ đâu. Mình cũng vậy, luôn mơ có một ngày sẽ tự viết được một bộ giả lập cho NES, ..."},{"title":"Phức tạp hóa vấn đề: Datepicker và các thuật toán đằng sau nó","url":"posts/phuc-tap-hoa-datepicker.html","desc":"Trong sê-ri bài viết **Phức tạp hóa vấn đề** này, mình sẽ trình bày các vấn đề kĩ thuật đằng sau những tác vụ đơn giản thường gặp trong công việc hằng ngày. Sẽ thật là tệ nếu chúng ta chỉ là những lập trình viên chỉ biết dùng những thứ được dọn ra sẵn và dâng tận miệng chỉ để xong việc, mà bỏ qua nh..."},{"title":"Phức tạp hoá vấn đề: Phân tích và mô phỏng nút cảm xúc của Facebook","url":"posts/phuc-tap-hoa-facebook-reaction.html","desc":"Tiếp tục sê-ri Phức tạp hoá vấn đề lần này, chúng ta sẽ cùng tìm hiểu và mô phỏng lại một chức năng mà mọi người đang bắt đầu sử dụng hằng ngày, đó là chức năng thể hiện cảm xúc (reaction) của Facebook...."},{"title":"Lập trình và Toán học","url":"posts/lap-trinh-va-toan-hoc.html","desc":"Tui và Toán đã từng là hai kẻ thù không đội trời chung trong suốt hơn mười lăm năm ròng rã. Ngay từ ánh nhìn đầu tiên đã ghét nhau rồi..."},{"title":"\"Bí mật\" đằng sau bảng hiệu Like của Facebook","url":"posts/facebook-sun-backend.html","desc":"Ngày hôm qua mình có dịp đến tham quan campus của Facebook ở Palo Alto.Nói về mấy cái ấn tượng ở đây thì chắc cũng nhiều người đã kể về nó trước rồi. Chỉ có một điểm đáng chú ý nhất là cái bảng hiệu có biểu tượng Like đặc trưng của Facebook đặt ở ngay cổng vào khu campus..."},{"title":"rake bower:install trong Docker","url":"posts/rake-bower-docker.html","desc":"Nếu xài Docker làm môi trường dev khi làm việc với Rails, hẳn sẽ có lục bạn gặp lỗi sau khi chạy `rake bower:install`:```bower ESUDO Cannot be run with sudo```Nguyên nhân là vì `bower` không \"thích\" chạy với quyền root vì sẽ dễ dẫn đến các vấn đề về quyền truy cập về sau..."},{"title":"Tự tạo SSH tunnel để forward port ra remote server","url":"posts/ssh-tunnel-reverse-proxy.html","desc":"Khi làm việc, đôi lúc bạn chạy server ở localhost nhưng cần truy cập vào nó từ một thiết bị khác không cùng trong mạng nội bộ, ví dụ chạy web để demo cho khách hàng xem, hoặc muốn test API trên localhost của bạn từ mobile app..."},{"title":"Tính tổng các số Fibonacci từ 1 tới 4 triệu","url":"posts/fibonacci-4m.html","desc":"Cuối tuần này có nói chuyện với bác [@haond](http://kipalog.com/users/nguyenduyhao1111/mypage) về một đề tài khá là thú vị, đó là bài toán: **Tính tổng các số Fibonacci từ 1 tới 4 triệu**..."}]}